ERP.belugaerp/src/DataProcessors/бг_ЗаменаМенеджераВПунктахНазначения/бг_ЗаменаМенеджераВПунктахНазначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>бг_ЗаменаМенеджераВПунктахНазначения</name>
  <attributes>
    <name>МенеджерПоиска</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерЗамены</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутТорговогоПредставителяЗамены</name>
    <type>
      <types>CatalogRef.бг_МаршрутыТорговыхПредставителей</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПунктыНазначения</name>
    <attributes>
      <name>Флаг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктНазначения</name>
      <type>
        <types>CatalogRef.битПунктыНазначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>МаршрутТорговогоПредставителя</name>
      <type>
        <types>CatalogRef.бг_МаршрутыТорговыхПредставителей</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакЭТК</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ERP.belugaerp/src/InformationRegisters/бг_МенеджерыПунктовНазначения/бг_МенеджерыПунктовНазначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_МенеджерыПунктовНазначения</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>МаршрутТорговогоПредставителя</name>
    <type>
      <types>CatalogRef.бг_МаршрутыТорговыхПредставителей</types>
    </type>
  </resources>
  <resources>
    <name>ПризнакЭТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ПунктНазначения</name>
    <type>
      <types>CatalogRef.битПунктыНазначения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/DataProcessors/бг_ЗаменаМенеджераВПунктахНазначения/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоднятьФлаги(Команда)	
	Для Каждого Строка Из Объект.ПунктыНазначения Цикл
		Строка.Флаг = Истина;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОпуститьФлаги(Команда)
	Для Каждого Строка Из Объект.ПунктыНазначения Цикл
		Строка.Флаг = Ложь;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Отобрать(Команда)
	Если ЗначениеЗаполнено(Объект.МенеджерПоиска) Тогда
		ОтобратьНаСервере()
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Заменить(Команда)
	Если ЗначениеЗаполнено(Объект.МенеджерЗамены)
		И ЗначениеЗаполнено(ДатаЗамены) Тогда
		ЗаменитьНаСервере(); 
	КонецЕсли;
КонецПроцедуры

#КонецОбласти //ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИфункции 

&НаСервере
Процедура ОтобратьНаСервере()
	
	Запрос = Новый Запрос;	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИСТИНА КАК Флаг,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(бг_МенеджерыПунктовНазначения.ПунктНазначения.Клиент) = ТИП(Справочник.Контрагенты)
	|			ТОГДА ЕСТЬNULL(Контрагенты.Ссылка, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(Организации.Ссылка, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|	КОНЕЦ КАК Контрагент,
	|	бг_МенеджерыПунктовНазначения.ПунктНазначения КАК ПунктНазначения,
	|	бг_МенеджерыПунктовНазначения.Менеджер КАК Менеджер,
	|	бг_МенеджерыПунктовНазначения.МаршрутТорговогоПредставителя КАК МаршрутТорговогоПредставителя,
	|	бг_МенеджерыПунктовНазначения.ПризнакЭТК КАК ПризнакЭТК
	|ИЗ
	|	РегистрСведений.бг_МенеджерыПунктовНазначения.СрезПоследних(&ДатаЗамены, ) КАК бг_МенеджерыПунктовНазначения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО бг_МенеджерыПунктовНазначения.ПунктНазначения.Клиент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО бг_МенеджерыПунктовНазначения.ПунктНазначения.Клиент = Организации.Ссылка
	|ГДЕ
	|	бг_МенеджерыПунктовНазначения.Менеджер = &МенеджерПоиска";			   
	
	Запрос.УстановитьПараметр("МенеджерПоиска" , Объект.МенеджерПоиска);
	Запрос.УстановитьПараметр("ДатаЗамены"	   , ДатаЗамены);
	
	УстановитьПривилегированныйРежим(Истина);
	Объект.ПунктыНазначения.Загрузить(Запрос.Выполнить().Выгрузить());
	УстановитьПривилегированныйРежим(Ложь);	
	
КонецПроцедуры 

&НаСервере
Процедура ЗаменитьНаСервере()
	
	ЗаписанныеЗаписи = 0; 
	
	Для Каждого Строка из Объект.ПунктыНазначения Цикл  
		
		Если Строка.Флаг Тогда 
			
			МенеджерЗаписи = РегистрыСведений.бг_МенеджерыПунктовНазначения.СоздатьМенеджерЗаписи();
			
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Строка);	
			
			МенеджерЗаписи.Период   = ДатаЗамены;
			МенеджерЗаписи.Менеджер	= Объект.МенеджерЗамены;
			
			Если ЗначениеЗаполнено(Объект.МаршрутТорговогоПредставителяЗамены) Тогда
				МенеджерЗаписи.МаршрутТорговогоПредставителя = Объект.МаршрутТорговогоПредставителяЗамены;
			КонецЕсли;
 			
			Попытка
				
				МенеджерЗаписи.Записать();
				ЗаписанныеЗаписи = ЗаписанныеЗаписи + 1;
				
			Исключение      
				
				ТекстСообщения = НСтр("ru = 'Записать пункт назначения %1 не удалось. Ошибка: %2.'");
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ТекстСообщения,
																Строка.ПунктНазначения,
																ОписаниеОшибки()));  
				
			КонецПопытки;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	ТекстСообщения = НСтр("ru = 'Изменено %1 пунктов назначения.'");
	ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ТекстСообщения, ЗаписанныеЗаписи));
	
КонецПроцедуры

#КонецОбласти //СлужебныеПроцедурыИфункции
